xzcvczx/mla-legacy/Combo/Google Map/Configs/HWP_MEB_PIC32_ETH_SK_8PMP_QVGAv1.h
// -----------------------------------
// Other driver dependencies
// -----------------------------------
#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
    #define USE_TCON_SSD1289
    #define USE_TCON_MODULE
    
#elif defined (GFX_USE_DISPLAY_PANEL_TFT_G320240DTSW_69W_TP_E)
    #define GFX_USE_TCON_HX8238
    #define USE_TCON_MODULE

#else
    #define GFX_USE_TCON_CUSTOM
#endif	


/*********************************************************************
* DISPLAY PARALLEL INTERFACE 
*********************************************************************/
/*
   Select the correct Parallel Master Port Interface Driver.
   This selection is valid only for parallel interface. When using
   display drivers that uses serial interface, this portion should be
   commented out or removed.
*/
	// EPMP is exclusive to GB210 devices and PMP to some devices
	#if defined (__PIC24FJ256DA210__)
		// EPMP is used by graphics controller
	#elif defined (__PIC24FJ256GB210__)
		#define USE_GFX_EPMP
	#else
		#define USE_GFX_PMP
	#endif

/*********************************************************************
* PARALLEL MASTER PORT INTERFACE TIMING 
*********************************************************************/
	// When using the Parallel Master Port (or Enhanced Parallel Master Port) the 
	// PMP timing must be defined for the following:
	// PMP_DATA_SETUP_TIME or EPMPCSx_DATA_SETUP (for DWAITB) 
	// PMP_DATA_WAIT_TIME or EPMPCSx_DATA_WAIT_TIME (for DWAITM) 
	// and PMP_DATA_HOLD_TIME or EPMPCSx_DATA_HOLD_TIME (for DWAITE)
    // where x is 1 or 2 (EPMP has 2 chip selects)
	// All values are timing parameters in ns.
	// The timing is dependent on the display controller sampling period if 
	// interfacing with the display controller or device AC timing requirements
	// if interfacing with a device (such as SRAM or Parallel Flash memory).
	// Refer to your specific display controller or device to determine the 
	// optimum (fastest) timing requirement for your interface. 

#if defined (USE_GFX_PMP) 

    #if defined (GFX_USE_DISPLAY_CONTROLLER_SSD1926) 

        #define PMP_DATA_SETUP_TIME                (18)    
        #define PMP_DATA_WAIT_TIME                 (82)  // based on the minimum pulse width requirement of CS signal of SSD1926     
        #define PMP_DATA_HOLD_TIME                 (0)    

    #elif defined (GFX_USE_DISPLAY_CONTROLLER_S1D13517)

        #error "Set the correct inteface timing for Epson Controller"
        #define PMP_DATA_SETUP_TIME                (xx)    
        #define PMP_DATA_WAIT_TIME                 (xx)  // See Epson S1D13517 data sheet for details
        #define PMP_DATA_HOLD_TIME                 (x)    

    #elif defined (GFX_USE_DISPLAY_CONTROLLER_LGDP4531)

        #define PMP_DATA_SETUP_TIME                (25)    
        #define PMP_DATA_WAIT_TIME                 (20)  // See LGDP4531 data sheet for details
        #define PMP_DATA_HOLD_TIME                 (5)    

    #else
        #error "USE_GFX_PMP is defined but no timing values are defined for the selected hardware inteface"
    #endif

#endif //#if defined (USE_GFX_PMP) 

#if defined (USE_GFX_EPMP)

    #if defined (GFX_USE_DISPLAY_CONTROLLER_SSD1926) 

        #define EPMPCS1_DATA_SETUP_TIME             (18)    
        #define EPMPCS1_DATA_WAIT_TIME              (82)  // based on the minimum pulse width requirement of CS signal of SSD1926     
        #define EPMPCS1_DATA_HOLD_TIME              (0)    

    #elif defined (GFX_USE_DISPLAY_CONTROLLER_S1D13517)

        #error "Set the correct inteface timing for Epson Controller"
        #define EPMPCS1_DATA_SETUP_TIME             (xx)    
        #define EPMPCS1_DATA_WAIT_TIME              (xx)  // See Epson S1D13517 data sheet for details
        #define EPMPCS1_DATA_HOLD_TIME              (x)    

    #elif defined (GFX_USE_DISPLAY_CONTROLLER_MCHP_DA210)
        
        // Since the display controller is built into the PIC24FJ256DA210
        // microcontroller, the timing shown here are based on the 
        // two memory devices (SRAM and Parallel Flash) mounted on the
        // development Board. All time are in ns.
        // EPMPCSx_DATA_SETUP_TIME (for DWAITB), 
        // EPMPCSx_DATA_WAIT_TIME (for DWAITM), 
        // and EPMPCSx_DATA_HOLD_TIME (for DWAITE)
        // are only used when accessing data from the External SRAM or External Parallel Flash
        // using CPU accesses, 
        // where:   
        //      x = 1 for CS1 
        //      x = 2 for CS2
        
        // When the Graphics Module is used, the EPMP timing is based on the EPMPCSx_DATA_AMWAIT_TIME
        
        // based on the IS61LV25616AL RAM Device
        #define EPMPCS1_ENABLE                              // use this to enable the use of EPMP CS1
        #define EPMPCS1_ADDRESS_LINE_COUNT          (18)    // use 18 address lines (PMA[0:17]
		#define EPMPCS1_DATA_SETUP_TIME             (0)	    // 
		#define EPMPCS1_DATA_WAIT_TIME		        (10)    // 
		#define EPMPCS1_DATA_HOLD_TIME		        (0)		// 
        
        // values are based on the SST39VF400A Parallel Flash Device (55 ns access time)
        // Since access time is 55 ns and Write Timing are the following:
        //      For programming (assuming a WE controlled Programming)
        //          WE pulse width = 40 ns (min)
        //      For reading
        //          OE to data active = 30 ns (max)
        //          OE to data high-Z output = 15 ns (max)
        //          55 ns access time
        //      We need to fulfill 55 ns then.
               
        #define EPMPCS2_ENABLE                              // use this to enable the use of EPMP CS2
        #define EPMPCS2_ADDRESS_LINE_COUNT          (18)    // use 18 address lines (PMA[0:17]
		#define EPMPCS2_DATA_SETUP_TIME             (0)	    // based on OE to data active 
		#define EPMPCS2_DATA_WAIT_TIME		        (55)	// based on 55 - 30 - 10 = 10 ns (since access time is 55 ns) 
		#define EPMPCS2_DATA_HOLD_TIME		        (0)     // bsaed on OE to data high-Z output 
    
    #else
        #error "USE_GFX_PMP is defined but no timing values are defined for the selected hardware inteface"
    #endif
    
#endif //#if defined (USE_GFX_PMP) || defined (USE_GFX_EPMP)

/*********************************************************************
* PARALLEL MASTER PORT INTERFACE TIMING AND POLARITIES 
*********************************************************************/
/*
    This portion sets up the EPMP port timing when Graphics Module is
    used as a Alternate Master in EPMP (See Family Reference Manual (FRM)
    Section 42. Enhanced Parallel Master Port (EPMP)) for details.

    Macros to define the access timing of the parallel device in EPMP chip 
	selects.  This value is used to calculate the AMWAIT cycles needed in EPMP
	Alternate Master I/Os direct access (EPMP bypass mode) (MSTSEL = 0x3). 
	When in this mode the Alternate Master (in this case Graphics Module)
	will use the clock specified by the G1CLKSEL bits of CLKDIV register
	in the oscillator module. There are two possible values: 48 Mhz and 
	96 Mhz. The equation used is:
	    temp = (1000000000ul) / ((CLKDIVbits.G1CLKSEL == 1)? 960000000ul : 480000000);
		
		if (EPMPCSx_ACCESS_TIME <= (temp*3))
		    PMCSxMDbits.AMWAIT = 0;
		else if (EPMPCSx_ACCESS_TIME > temp)
	    {
            PMCSxMDbits.AMWAIT = (EPMPCSx_ACCESS_TIME / temp);
            if ((EPMPCSx_ACCESS_TIME % temp) > 0)
                PMCSxMDbits.AMWAIT += 1;
        }          
		 
        where:   
            x = 1 for CS1 
            x = 2 for CS2
            the factor of 3 is used because of the fact that an AMWAIT of 0 means
            that 3 alternate master cycles are used per read/write.
            Actual cycles used is 3 + AMWAIT cycles per read/write access.

*/
#ifdef PIC24FJ256DA210_DEV_BOARD

	#if defined (GFX_EPMP_CS1_BASE_ADDRESS)
		#define EPMPCS1_CS_POLARITY	GFX_ACTIVE_LOW
		#define EPMPCS1_WR_POLARITY	GFX_ACTIVE_LOW
		#define EPMPCS1_RD_POLARITY	GFX_ACTIVE_LOW
		#define EPMPCS1_BE_POLARITY	GFX_ACTIVE_LOW


		#define EPMPCS1_ACCESS_TIME                 (10)		// chip select 1 Alternate Master access time.

	#endif

	#if defined (GFX_EPMP_CS2_BASE_ADDRESS)
		#define EPMPCS2_CS_POLARITY	GFX_ACTIVE_LOW
		#define EPMPCS2_WR_POLARITY	GFX_ACTIVE_LOW
		#define EPMPCS2_RD_POLARITY	GFX_ACTIVE_LOW
		#define EPMPCS2_BE_POLARITY	GFX_ACTIVE_LOW

