xzcvczx/mla-legacy/Combo/Google Map/Configs/HWP_MEB_PIC32_ETH_SK_8PMP_QVGAv1.h
        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
        #define DisplaySetCommand()         LATCbits.LATC2 = 0
        #define DisplaySetData()            LATCbits.LATC2 = 1

        // Definitions for CS pin
        #define DisplayConfig()             TRISDbits.TRISD10 = 0             
        #define DisplayEnable()             LATDbits.LATD10 = 0
        #define DisplayDisable()            LATDbits.LATD10 = 1

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()         
        #define DisplayFlashEnable()        
        #define DisplayFlashDisable()       

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()        
        #define DisplayPowerOn()            
        #define DisplayPowerOff()           
        
        // Definitions for backlight control pin
        #define DisplayBacklightConfig()    TRISDbits.TRISD0 = 0  
        #define DisplayBacklightOn()        LATDbits.LATD0 = 0
        #define DisplayBacklightOff()       LATDbits.LATD0 = 1   

    #else
    
        #error "Selected Device is not supported"
        
    #endif

// end of #if defined (GFX_PICTAIL_V3)  

// -----------------------------------
// When using MultiMedia Expansion Board
// -----------------------------------
/*
    This development board will be compatible with:
    1. PIC32 Starter Kits
       - PIC32 Starter Kit (DM320001)
       - PIC32 USB Starter Kit II (DM320003-2)
       - PIC32 Ethernet Starter Kit (DM320004)
*/

#elif defined (MULTI_MEDIA_BOARD_DM00123)

     /********
     * PIC32 will use the SET and CLR SFRs for the I/O.
     * These are atomic settings that are recommended when
     * modifying SFRs
     ********/
     // Definitions for reset pin
     #define DisplayResetConfig()           TRISACLR = _TRISA_TRISA10_MASK    
     #define DisplayResetEnable()           LATACLR = _LATA_LATA10_MASK
     #define DisplayResetDisable()          LATASET = _LATA_LATA10_MASK

     // Definitions for RS pin
     #define DisplayCmdDataConfig()         AD1PCFGSET = _AD1PCFG_PCFG10_MASK, TRISBCLR = _TRISB_TRISB10_MASK
     #define DisplaySetCommand()            LATBCLR = _LATB_LATB10_MASK
     #define DisplaySetData()               LATBSET = _LATB_LATB10_MASK

     // Definitions for CS pin
     #define DisplayConfig()                TRISGCLR = _TRISG_TRISG13_MASK
     #define DisplayEnable()                LATGCLR = _LATG_LATG13_MASK
     #define DisplayDisable()               LATGSET = _LATG_LATG13_MASK

     // Definitions for FLASH CS pin
     #define DisplayFlashConfig()          
     #define DisplayFlashEnable()        
     #define DisplayFlashDisable()       

     // Definitions for POWER ON pin
     #define DisplayPowerConfig()        
     #define DisplayPowerOn()            
     #define DisplayPowerOff()           

    #define DisplayBacklightConfig()    TRISDbits.TRISD0 = 0  
    #define DisplayBacklightOn()        LATDbits.LATD0 = 0
    #define DisplayBacklightOff()       LATDbits.LATD0 = 1   
// end of #elif defined (MULTI_MEDIA_BOARD_DM00123)

// -----------------------------------
// When using PIC24FJ256DA210 Development Board
// -----------------------------------
/*
    This development board only has PIC24FJ256DA210 device.
*/

#elif defined (PIC24FJ256DA210_DEV_BOARD)
	
    // Definitions for POWER ON pin
    #define DisplayPowerConfig()            TRISAbits.TRISA5 = 0       
    #define DisplayPowerOn()                LATAbits.LATA5 = 1           
    #define DisplayPowerOff()               LATAbits.LATA5 = 0

    // Definitions for backlight control pin
    #define DisplayBacklightConfig()        
    #define DisplayBacklightOn()        
    #define DisplayBacklightOff()          

// end of #elif defined (PIC24FJ256DA210_DEV_BOARD)

// -----------------------------------
// When using GFX_PICTAIL_V2
// -----------------------------------
/*
    This development board is obsolete and is
    not recommended to be used in new designs.
    Compatible with Explorer 16 (EXPLORER_16)
*/

#elif defined (GFX_PICTAIL_V2)

    #if defined (GFX_USE_DISPLAY_CONTROLLER_LGDP4531)

        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)

            // Definitions for reset pin
            #define DisplayResetConfig()        TRISAbits.TRISA4 = 0    
            #define DisplayResetEnable()        LATAbits.LATA4 = 0
            #define DisplayResetDisable()       LATAbits.LATA4 = 1

            // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISAbits.TRISA1 = 0
            #define DisplaySetCommand()         LATAbits.LATA1 = 0
            #define DisplaySetData()            LATAbits.LATA1 = 1

            // Definitions for CS pin
            #define DisplayConfig()             TRISBbits.TRISB15 = 0             
            #define DisplayEnable()             LATBbits.LATB15 = 0
            #define DisplayDisable()            LATBbits.LATB15 = 1

            // Definitions for POWER ON pin
            #define DisplayPowerConfig()        TRISAbits.TRISA10 = 0
            #define DisplayPowerOn()            LATAbits.LATA10 = 0
            #define DisplayPowerOff()           LATAbits.LATA10 = 1

            #define DisplayBacklightConfig()     
            #define DisplayBacklightOn()        
            #define DisplayBacklightOff()       

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()        TRISAbits.TRISA8 = 0        
            #define DisplayFlashEnable()        LATAbits.LATA8 = 1
            #define DisplayFlashDisable()       LATAbits.LATA8 = 0

        #elif defined (__PIC32MX__)

            /********
             * PIC32 will use the SET and CLR SFRs for the I/O.
             * These are atomic settings that are recommended when
             * modifying SFRs
             ********/
	            // Definitions for reset pin
            #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK    
            #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
            #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

