xzcvczx/mla-legacy/Combo/Google Map/Configs/HWP_MEB_PIC32_ETH_SK_8PMP_QVGAv1.h
#if defined (USE_TOUCHSCREEN_RESISTIVE)

	/*********************************************************************
	* Resistive Touch Screen A/D and I/O Specific Macros 
	*********************************************************************/
	// ADC Input Channel Selector
	#if defined(__dsPIC33F__) || defined(__PIC24H__)
		#define TOUCH_ADC_INPUT_SEL   AD1CHS0
    #else // all other supported devices
		#define TOUCH_ADC_INPUT_SEL   AD1CHS
    #endif

	// ADC Sample Start 
	#define TOUCH_ADC_START   AD1CON1bits.SAMP 

	// ADC Status
	#define TOUCH_ADC_DONE   AD1CON1bits.DONE

	// Hardware Platform dependend macros
	/* ----------------------------------------- */
	#if defined (PIC24FJ256DA210_DEV_BOARD)
	/* ----------------------------------------- */
		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* PIC24FJ256DA210 Development Board does 
		 * not have a temperature sensor 
		 */
		#define ADC_POT			5
		#define ADC_XPOS		16
		#define ADC_YPOS		18

		// ADC Port Control Bits
		#define ADC_POT_PCFG	ANSBbits.ANSB5
		#define ADPCFG_XPOS		ANSCbits.ANSC4
		#define ADPCFG_YPOS		ANSGbits.ANSG7

		// Y port definitions
		#define LAT_XPOS    LATCbits.LATC4
		#define TRIS_XPOS   TRISCbits.TRISC4
		#define LAT_XNEG    LATAbits.LATA2
		#define TRIS_XNEG   TRISAbits.TRISA2
	     
		// X port definitions
		#define LAT_YPOS    LATGbits.LATG7
		#define TRIS_YPOS   TRISGbits.TRISG7
   		#define LAT_YNEG    LATAbits.LATA1
		#define TRIS_YNEG   TRISAbits.TRISA1
    
    // end of #if defined (PIC24FJ256DA210_DEV_BOARD)...
    
	/* ----------------------------------------- */
	#elif defined (MULTI_MEDIA_BOARD_DM00123)
	/* ----------------------------------------- */

		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* The Multi-Media Development Board does not have a
		 * analog pot or temperature sensor (see BMA150 for temperature
		 * sensor data
		 */
		#define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN11
		#define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN14

		// ADC Port Control Bits
		#define ADPCFG_XPOS AD1PCFGbits.PCFG11
		#define ADPCFG_YPOS AD1PCFGbits.PCFG14
		
		// X port definitions
		#define LAT_XPOS    LATBbits.LATB11
		#define TRIS_XPOS   TRISBbits.TRISB11
		#define LAT_XNEG    LATBbits.LATB13
		#define TRIS_XNEG   AD1PCFGbits.PCFG13 = 1, TRISBbits.TRISB13

		// Y port definitions
		#define LAT_YPOS    LATBbits.LATB14
		#define TRIS_YPOS   TRISBbits.TRISB14
		#define LAT_YNEG    LATBbits.LATB12 
		#define TRIS_YNEG   AD1PCFGbits.PCFG12 = 1, TRISBbits.TRISB12

    // end of #elif defined (MULTI_MEDIA_BOARD_DM00123)...

	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_V2) // && defined (EXPLORER_16)  
	/* ----------------------------------------- */
	// NOTE: GFX_PICTAIL_V2 can only be paired with Explorer 16

		#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP        4
			#define ADC_POT         0
			#define ADC_XPOS		5
			#define ADC_YPOS		4

			// ADC Port Control Bits
			#define ADC_POT_TRIS    TRISAbits.TRISA0
			#define ADC_POT_PCFG    AD1PCFGLbits.PCFG0
			#define ADPCFG_XPOS		AD1PCFGLbits.PCFG5
			#define ADPCFG_YPOS		AD1PCFGLbits.PCFG4

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB3
			#define TRIS_XPOS		TRISBbits.TRISB3
			#define LAT_XNEG		LATCbits.LATC9
			#define TRIS_XNEG		TRISCbits.TRISC9

			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB2
			#define TRIS_YPOS		TRISBbits.TRISB2
			#define LAT_YNEG		LATCbits.LATC8
			#define TRIS_YNEG		TRISCbits.TRISC8

		#elif defined(__PIC32MX__)

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP		ADC_CH0_POS_SAMPLEA_AN4
			#define ADC_POT			ADC_CH0_POS_SAMPLEA_AN5
			#define ADC_XPOS		ADC_CH0_POS_SAMPLEA_AN11
			#define ADC_YPOS		ADC_CH0_POS_SAMPLEA_AN10

			// ADC Port Control Bits
			#define ADC_POT_PCFG    AD1PCFGbits.PCFG5
	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11
			#define LAT_XNEG		LATGbits.LATG13
			#define TRIS_XNEG		TRISGbits.TRISG13
			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10
			#define LAT_YNEG		LATGbits.LATG12
			#define TRIS_YNEG		TRISGbits.TRISG12


		#else // all other supported PIC devices

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP		4
			#define ADC_POT			5
			#define ADC_XPOS		11
			#define ADC_YPOS		10

			// ADC Port Control Bits
			#define ADC_POT_PCFG    AD1PCFGbits.PCFG5
	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11
			#define LAT_XNEG		LATGbits.LATG13
			#define TRIS_XNEG		TRISGbits.TRISG13
			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10
			#define LAT_YNEG		LATGbits.LATG12
			#define TRIS_YNEG		TRISGbits.TRISG12

		#endif

    // end of #elif defined (GFX_PICTAIL_V2) ...
    
	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_V3) // && defined (EXPLORER_16) || PIC32 Starter Kits 
	/* ----------------------------------------- */
	// NOTE: GFX_PICTAIL_V3 can be paired with Explorer 16 or with PIC32 Starter Kits

		#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP        4
			#define ADC_POT         0
			#define ADC_XPOS		5
			#define ADC_YPOS		4

			// ADC Port Control Bits
			#define ADC_POT_TRIS    TRISAbits.TRISA0
			#define ADC_POT_PCFG    AD1PCFGLbits.PCFG0
			#define ADPCFG_XPOS		AD1PCFGLbits.PCFG5
			#define ADPCFG_YPOS		AD1PCFGLbits.PCFG4

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB3
			#define TRIS_XPOS		TRISBbits.TRISB3
			#define LAT_XNEG		LATCbits.LATC9
			#define TRIS_XNEG		TRISCbits.TRISC9

			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB2
			#define TRIS_YPOS		TRISBbits.TRISB2
			#define LAT_YNEG		LATCbits.LATC8
			#define TRIS_YNEG		TRISCbits.TRISC8

		#elif defined(__PIC32MX__)

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP		ADC_CH0_POS_SAMPLEA_AN4
			#define ADC_POT			ADC_CH0_POS_SAMPLEA_AN5
			#define ADC_XPOS		ADC_CH0_POS_SAMPLEA_AN11
			#define ADC_YPOS		ADC_CH0_POS_SAMPLEA_AN10

			// ADC Port Control Bits
			#define ADC_POT_PCFG    AD1PCFGbits.PCFG5
	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11

			#if defined(_USB) && !defined (PIC32_USB_SK_DM320003_1) && !defined (PIC32_ENET_SK_DM320004)
				#define LAT_XNEG		LATGbits.LATG15
				#define TRIS_XNEG		TRISGbits.TRISG15
			#else  // other supported PIC 32 devices
				#define LAT_XNEG		LATDbits.LATD9
				#define TRIS_XNEG		TRISDbits.TRISD9
			#endif

			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10
			#define LAT_YNEG		LATDbits.LATD8
			#define TRIS_YNEG		TRISDbits.TRISD8

		#else // for PIC24F devices

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP		4
			#define ADC_POT			5
			#define ADC_XPOS		11
			#define ADC_YPOS		10

			// ADC Port Control Bits
    		#if defined(__PIC24FJ256GB210__)
    			// ADC Port Control Bits
	        	#define ADC_POT_PCFG	ANSBbits.ANSB5
    		    #define ADPCFG_XPOS		ANSBbits.ANSB11
		        #define ADPCFG_YPOS		ANSBbits.ANSB10
            #else
        		#define ADC_POT_PCFG    AD1PCFGbits.PCFG5
    	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
    			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10
            #endif
			// X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11
			#define LAT_XNEG		LATDbits.LATD9
			#define TRIS_XNEG		TRISDbits.TRISD9

			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10
			#define LAT_YNEG		LATDbits.LATD8
			#define TRIS_YNEG		TRISDbits.TRISD8

		#endif

	#endif //#elif defined (GFX_PICTAIL_V3) 

	/*********************************************************************
	* Touch Screen X and Y orientation
	*********************************************************************/
	/*********************************************************************
	Description:
		The usage of the resistive touch screen will be affected 
		by the way the hardware is mapped to the A/D channels that
		samples the touch. Since resistive touch is basically a 
		measurement of X and Y coordinates the following are macros
		that can modify the touch algorithm when sampling the 
		touch.
		FLIP_X - will flip the x direction. 	
		FLIP_Y - will flip the y direction.
		SWAP_X_AND_Y - will swap the x and y sampling.
		
		As long as the (X-,Y-) and (X+,Y+) are used consistently,
		and connected properly in hardware, the macros above
		can provide options to the user to align the touch screen
		to the screen orientation.
	*********************************************************************/

	/* ----------------------------------------- */
	#if defined (GFX_PICTAIL_V2)
	/* ----------------------------------------- */
        #define TOUCHSCREEN_RESISTIVE_FLIP_Y

	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_V3)              || \
		  defined (PIC24FJ256DA210_DEV_BOARD)   || \
	      defined (MULTI_MEDIA_BOARD_DM00123) 
	/* ----------------------------------------- */
		#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)	
			#if (DISP_ORIENTATION == 0)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
				#define TOUCHSCREEN_RESISTIVE_FLIP_Y
			#elif (DISP_ORIENTATION == 180)	
				#define TOUCHSCREEN_RESISTIVE_SWAP_XY
				#define TOUCHSCREEN_RESISTIVE_FLIP_X
			#elif (DISP_ORIENTATION == 270)	
				#define TOUCHSCREEN_RESISTIVE_FLIP_X
				#define TOUCHSCREEN_RESISTIVE_FLIP_Y
			#endif	
		#endif

